#-------------------ЗАДАЧА №4-----------------------#

'''Факториал числа: Напишите программу, которая вычисляет
факториал введенного числа.'''

number_user = int(input("Введите число от 0 до 100: "))

fact = 1

while number_user > 0:
    fact *= number_user
    number_user -= 1
print(f"Факториал числа {fact}")  